{
  "area": {
    "3D geometria": "This should be only about geometry in the tradition of Euclid, i.e. about lines, points, angles, circles, ... If merely a 3D object is used, that is not enough (e.g. a 'tetrahedron' could be used just for its graph-theoretic properties of vertices and edges -- which has nothing to do with its 3D geometry).",
    "Algebra": "High-school math competition algebra. Almost all problems involving real numbers should have this tag.",
    "Funkcionálna rovnica": "",
    "Geometria": "This should be only about geometry in the tradition of Euclid, i.e. about lines, points, angles, circles, ...",
    "Goniometria": "Algebraic problems about the trigonometric functions.",
    "Logická úloha": "Problems that are purely about logic, i.e. there is no underlying theory (it's not about numbers, not about geometry, ... just pure logic).",
    "Kombinatorika": "A broad area, high-school math competition combinatorics. This includes but is not limited to games, problems on grids, graphs, permutations, tilings, puzzles, ...",
    "Kombinatorická geometria": "This tag is mutually exclusive with tags 'Geometria' and '3D geometria'. Example terms: convex hulls, packings, tessellations, topology, ... Make sure that the problem does not fall under (synthetic) geometry; e.g. if it deals with lengths, angles, areas, collinearity, concyclic points, ... then it's likely a better fit for 'Geometria' or '3D geometria'. Also, if a problem is tagged with this, it should also fall under the area of 'Kombinatorika' (though it shouldn't be tagged as such, due to being less specific).",
    "Komplexné čísla": "",
    "Teória čísel": "Associated with natural numbers / integers, divisibility, rationality / irrationality, etc.",
    "Teória grafov": ""
  },
  "goal": {
    "Dôkaz existencie": "Objective is to prove the existence of some object. The proof needs not necessarily be a constructive one (i.e. proving existence without actually constructing one such object is fine).",
    "Konštrukčná úloha": "Objective is to construct some object (it is not enough to prove existince). This is more specific than 'Dôkaz existencie', so use only this tag if both are applicable.",
    "Optimalizačná úloha": "Problem where we a looking for a 'best' / minimal / maximal solution according to some metric. For example, in combinatorics, it could be about the smallest number of steps to reach some outcome. In algebra, it could be about minimizing some formula. This is more specific than 'Konštrukčná úloha' (since we are asking for best solution, whereas in constructive problems we are asking only for some solution) -- so if both are applicable, use only this tag.",
    "Dôkaz jednoznačnosti": "Objective is to prove that there is exactly one solution.",
    "Existuje riešenie?": "Objective is to find out if there is a solution -- i.e. either prove that a solution exists, or prove that a solution does not exist, for suitably defined 'solution'.",
    "Nájdite riešenie, ak existuje": "Objective is to find out if there is a solution, and if there is a solution, find one. This can only be applied to problems where it is not clear whether a solution exists. This is more specific than the tag 'Existuje riešenie?' so use only this tag if both are applicable.",
    "Všetky riešenia": "Objective is to find all solutions, for suitably defined 'solutions'. For example it could be something like 'determine all possible values of some property / variable X'.",
    "Počet riešení": "Objective is to find the number of solutions (we do not actually have to find the solutions themselves, just their number). This includes problems where we are to place an upper or lower bound on the number of solutions. Make sure that the count is the count of solutions (and not count of something else).",
    "Dôkaz všeobecného tvrdenia": "Objective is to prove that certain objects satisfy some property.",
    "Platí vo všeobecnosti?": "Objective is to either prove that certain objects satisfy some property, or find a counterexample.",
    "Dôkaz ekvivalencie": "Objective is to prove equivalence of two propositions. This is usually more specific than 'Všeobecný dôkaz', so use only this tag if both are applicable.",
    "Víťazná stratégia": "Objective is, given a game (usually with 2 players), determine which player has the winning strategy / prove that a given player has a winning strategy. Implies the area tag 'Kombinatorika' or 'Kombinatorická geometria'.",
    "Remizujúca stratégia": "Objective is, given a game (usually with 2 players), prove that a certain player can play such that they cannot lose, no matter what the other players are doing. Implies the area tag 'Kombinatorika' or 'Kombinatorická geometria'.",
    "Dôkaz neexistencie": "Objective is to prove that no object satisfies the property.",
    "Výpočet veličiny": "E.g. calculate the length / circumference / angle / ... Use this only when the problem asks us directly to calculate some value where it is *not immediately obvious how to calculate it*. It must be clear from the problem statement that the value is uniquely determined and that the hard part is calculating it from known information.",
    "Geometrická konštrukcia": "The task is to construct some geometric object (e.g. a point with some properties) using only some tools (e.g. compass and straightedge). Implies the area tag 'Geometria' or '3D geometria'."
  },
  "type": {
    "Absolútna hodnota": "",
    "Algebrogram": "",
    "Aritmetická postupnosť": "",
    "Binomický koeficient": "",
    "Celá časť": "",
    "Ciferný súčet": "",
    "Číselná sústava": "",
    "Deliteľnosť": "",
    "Dotyčnica": "",
    "Dotyčnicový štvoruholník": "",
    "Faktoriál": "",
    "Kombinačné číslo": "More specific than 'Faktoriál', so if both are applicable, use only this tag.",
    "Fibonacciho postupnosť": "",
    "Geometrická postupnosť": "",
    "Hra dvoch hráčov": "",
    "Hra 3+ hráčov": "",
    "Iterácia funkcie": "",
    "Kongruencie": "",
    "Kosoštvorec": "",
    "Kružnica opísaná": "",
    "Kružnica pripísaná": "",
    "Kružnica vpísaná": "",
    "Kvadratický polynóm": "",
    "Kvadratická rovnica": "",
    "Kvadratický zvyšok": "",
    "Kváder": "",
    "Lichobežník": "",
    "Magický štvorec": "",
    "Medián": "",
    "Množina bodov": "",
    "Mriežka": "Use if the problem involves a lattice or some other kind of regular grid.",
    "Najmenší spoločný násobok": "",
    "Najväčší spoločný deliteľ": "",
    "Nerovnosť": "",
    "Nesúdeliteľné čísla": "",
    "Obdĺžnik": "",
    "Objem": "",
    "Obsah": "",
    "Obvod": "",
    "Ortocentrum": "",
    "Palindróm": "",
    "Parita": "",
    "Pellova rovnica": "",
    "Periodická postupnosť": "",
    "Permutácia": "",
    "Pevný bod": "",
    "Polynóm": "Use only if the polynomial mentioned in the problem has an unknown / variable degree or degree at least 3.",
    "Povrch": "",
    "Pravouhlý trojuholník": "",
    "Priemer": "",
    "Primitívny koreň": "",
    "Prvočísla": "",
    "Rekurentná postupnosť": "Use only if the problem statement states the recurrence relation directly. If the recurrence is not immediately obvious, do not use.",
    "Rovnica": "",
    "Rovnobežník": "",
    "Rovnoľahlosť": "",
    "Rýchlosť": "",
    "Stredná priečka": "",
    "Stredová súmernosť": "",
    "Štvorec": "If the problem involves a square grid, instead use the 'Mriežka' tag instead of this.",
    "Sústava nerovníc": "More specific that 'Nerovnosť', if both are applicable use only this tag.",
    "Sústava rovníc": "More specific than 'Rovnica', if both are applicable use only this tag.",
    "Symediána": "",
    "Ťažisko": "",
    "Ťažnica": "",
    "Tetivový štvoruholník": "",
    "Triangulárne číslo": "",
    "Úsekový uhol": "",
    "Zvyšok po delení": ""
  },
  "technique": {
    "Analytická geometria": "",
    "AG nerovnosť": "",
    "Bezoutova veta": "",
    "Cauchyho nerovnosť": "",
    "Cevova veta": "",
    "Chordála": "",
    "Čínska zvyšková veta": "",
    "Desarguesova veta": "",
    "Dirichletov princíp": "",
    "Dôkaz sporom": "",
    "Eulerova funkcia": "",
    "Euklidova veta": "",
    "Extremálny princíp": "",
    "Feuerbachova kružnica": "",
    "Herónov vzorec": "",
    "Invariant": "",
    "Kružnicová inverzia": "",
    "Jensenova nerovnosť": "",
    "Kosínusová veta": "",
    "Kvadratická reciprocita": "",
    "Legendrov symbol": "",
    "Malá Fermatova veta": "",
    "Matematická indukcia": "",
    "Menelaova veta": "",
    "Miquelov bod": "",
    "Mocnosť bodu ku kružnici": "",
    "Pappova veta": "",
    "Pascalova veta": "",
    "Permutačná nerovnosť": "",
    "Pravdepodobnostná metóda": "",
    "Kombinatorické pravidlo súčinu": "",
    "Kombinatorické pravidlo súčtu": "",
    "Princíp inklúzie a exklúzie": "",
    "Projektívna geometria": "",
    "Ptolemaiova veta": "",
    "Pytagorova veta": "",
    "Schurova nerovnosť": "",
    "Sínusová veta": "",
    "Tálesova veta": "",
    "Trojuholníková nerovnosť": "",
    "Veta o osi uhla": "",
    "Veta o úsekovom uhle": "",
    "Vieta jumping": "",
    "Vietove vzťahy": "",
    "Wilsonova veta": "",
    "Podobnosť trojuholníkov": "",
    "Zhodnosť trojuholníkov": "",
    "Zsigmondyho veta": "",
    "Rozbor prípadov": ""
  }
}